arduino/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cpu=Microcontroller
menu.clock=Clock Source
menu.usb=USB Config
menu.serial=Serial Config
menu.bootloader=Bootloader Size

# MattairTech MT-D21E
mattairtech_mt_d21e.name=MattairTech MT-D21E
mattairtech_mt_d21e.vid.0=0x16D0
mattairtech_mt_d21e.pid.0=0x0557
mattairtech_mt_d21e.vid.1=0x16D0
mattairtech_mt_d21e.pid.1=0x0856
mattairtech_mt_d21e.vid.2=0x16D0
mattairtech_mt_d21e.pid.2=0x0B41
mattairtech_mt_d21e.build.mcu=cortex-m0plus
mattairtech_mt_d21e.build.f_cpu=48000000L
mattairtech_mt_d21e.build.usb_product="MT-D21E"
mattairtech_mt_d21e.build.usb_manufacturer="MattairTech"
mattairtech_mt_d21e.build.board=SAMD_ZERO
mattairtech_mt_d21e.build.core=arduino
mattairtech_mt_d21e.build.variant=MT_D21E
mattairtech_mt_d21e.build.variant_system_lib=
mattairtech_mt_d21e.build.vid=0x16D0
mattairtech_mt_d21e.upload.protocol=sam-ba
mattairtech_mt_d21e.bootloader.tool=arduino:openocd
mattairtech_mt_d21e.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32KHZ_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_mt_d21e.menu.clock.internal=INTERNAL
mattairtech_mt_d21e.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_mt_d21e.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED
mattairtech_mt_d21e.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_mt_d21e.menu.cpu.samd21e18a=SAMD21E18A
mattairtech_mt_d21e.menu.cpu.samd21e18a.upload.maximum_size=253952
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags}
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.ldscript=flash_256KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e18a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E18A.bin
mattairtech_mt_d21e.menu.cpu.samd21e17a=SAMD21E17A
mattairtech_mt_d21e.menu.cpu.samd21e17a.upload.maximum_size=122880
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ {build.usb_flags}
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.ldscript=flash_128KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.openocdscript=openocd_scripts/SAMD21E17A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e17a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E17A.bin
mattairtech_mt_d21e.menu.cpu.samd21e16a=SAMD21E16A
mattairtech_mt_d21e.menu.cpu.samd21e16a.upload.maximum_size=57344
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ {build.usb_flags}
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.ldscript=flash_64KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.openocdscript=openocd_scripts/SAMD21E16A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e16a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E16A.bin
mattairtech_mt_d21e.menu.cpu.samd21e15a=SAMD21E15A
mattairtech_mt_d21e.menu.cpu.samd21e15a.upload.maximum_size=24576
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ {build.usb_flags}
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.ldscript=flash_32KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e15a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21E15A.bin
mattairtech_mt_d21e.menu.bootloader.8kb=8KB
mattairtech_mt_d21e.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mattairtech_mt_d21e.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21e.menu.bootloader.8kb.upload.use_1200bps_touch=true
mattairtech_mt_d21e.menu.bootloader.8kb.upload.wait_for_upload_port=true
mattairtech_mt_d21e.menu.bootloader.8kb.upload.native_usb=true
mattairtech_mt_d21e.menu.bootloader.16kb=16KB
mattairtech_mt_d21e.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mattairtech_mt_d21e.menu.bootloader.16kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21e.menu.bootloader.16kb.upload.use_1200bps_touch=true
mattairtech_mt_d21e.menu.bootloader.16kb.upload.wait_for_upload_port=true
mattairtech_mt_d21e.menu.bootloader.16kb.upload.native_usb=true
mattairtech_mt_d21e.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_mt_d21e.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d21e.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d21e.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d21e.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d21e.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d21e.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.no_uart.build.serialcom_uart=NO_UART
mattairtech_mt_d21e.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d21e.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d21e.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d21e.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d21e.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d21e.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d21e.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d21e.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d21e.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d21e.menu.usb.hid=HID_ONLY
mattairtech_mt_d21e.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d21e.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d21e.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d21e.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d21e.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d21e.menu.usb.none=USB_DISABLED
mattairtech_mt_d21e.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d21e.menu.usb.none.build.pid=0x0856


