arduino/ArduinoCore-samd/boards.txt
# MattairTech MT-D21J
mattairtech_mt_d21j.name=MattairTech MT-D21J
mattairtech_mt_d21j.vid.0=0x16D0
mattairtech_mt_d21j.pid.0=0x0557
mattairtech_mt_d21j.vid.1=0x16D0
mattairtech_mt_d21j.pid.1=0x0856
mattairtech_mt_d21j.vid.2=0x16D0
mattairtech_mt_d21j.pid.2=0x0B41
mattairtech_mt_d21j.build.mcu=cortex-m0plus
mattairtech_mt_d21j.build.f_cpu=48000000L
mattairtech_mt_d21j.build.usb_product="MT-D21J"
mattairtech_mt_d21j.build.usb_manufacturer="MattairTech"
mattairtech_mt_d21j.build.board=SAMD_ZERO
mattairtech_mt_d21j.build.core=arduino
mattairtech_mt_d21j.build.variant=MT_L21J
mattairtech_mt_d21j.build.variant_system_lib=
mattairtech_mt_d21j.build.vid=0x16D0
mattairtech_mt_d21j.upload.protocol=sam-ba
mattairtech_mt_d21j.bootloader.tool=arduino:openocd
mattairtech_mt_d21j.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_mt_d21j.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32KHZ_CRYSTAL
mattairtech_mt_d21j.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_mt_d21j.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_mt_d21j.menu.clock.internal=INTERNAL
mattairtech_mt_d21j.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_mt_d21j.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED
mattairtech_mt_d21j.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_mt_d21j.menu.cpu.samd21j18a=SAMD21J18A
mattairtech_mt_d21j.menu.cpu.samd21j18a.upload.maximum_size=253952
mattairtech_mt_d21j.menu.cpu.samd21j18a.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags}
mattairtech_mt_d21j.menu.cpu.samd21j18a.build.ldscript=flash_256KB.ld
mattairtech_mt_d21j.menu.cpu.samd21j18a.build.openocdscript=openocd_scripts/SAMD21J18A.cfg
mattairtech_mt_d21j.menu.cpu.samd21j18a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21J18A.bin
mattairtech_mt_d21j.menu.cpu.samd21j17a=SAMD21J17A
mattairtech_mt_d21j.menu.cpu.samd21j17a.upload.maximum_size=122880
mattairtech_mt_d21j.menu.cpu.samd21j17a.build.extra_flags=-D__SAMD21J17A__ {build.usb_flags}
mattairtech_mt_d21j.menu.cpu.samd21j17a.build.ldscript=flash_128KB.ld
mattairtech_mt_d21j.menu.cpu.samd21j17a.build.openocdscript=openocd_scripts/SAMD21J17A.cfg
mattairtech_mt_d21j.menu.cpu.samd21j17a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21J17A.bin
mattairtech_mt_d21j.menu.cpu.samd21j16a=SAMD21J16A
mattairtech_mt_d21j.menu.cpu.samd21j16a.upload.maximum_size=57344
mattairtech_mt_d21j.menu.cpu.samd21j16a.build.extra_flags=-D__SAMD21J16A__ {build.usb_flags}
mattairtech_mt_d21j.menu.cpu.samd21j16a.build.ldscript=flash_64KB.ld
mattairtech_mt_d21j.menu.cpu.samd21j16a.build.openocdscript=openocd_scripts/SAMD21J16A.cfg
mattairtech_mt_d21j.menu.cpu.samd21j16a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21J16A.bin
mattairtech_mt_d21j.menu.cpu.samd21j15a=SAMD21J15A
mattairtech_mt_d21j.menu.cpu.samd21j15a.upload.maximum_size=24576
mattairtech_mt_d21j.menu.cpu.samd21j15a.build.extra_flags=-D__SAMD21J15A__ {build.usb_flags}
mattairtech_mt_d21j.menu.cpu.samd21j15a.build.ldscript=flash_32KB.ld
mattairtech_mt_d21j.menu.cpu.samd21j15a.build.openocdscript=openocd_scripts/SAMD21J15A.cfg
mattairtech_mt_d21j.menu.cpu.samd21j15a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD21J15A.bin
mattairtech_mt_d21j.menu.cpu.saml21j18b=SAML21J18B
mattairtech_mt_d21j.menu.cpu.saml21j18b.upload.maximum_size=253952
mattairtech_mt_d21j.menu.cpu.saml21j18b.build.extra_flags=-D__SAML21J18B__ {build.usb_flags}
mattairtech_mt_d21j.menu.cpu.saml21j18b.build.ldscript=flash_256KB.ld
mattairtech_mt_d21j.menu.cpu.saml21j18b.build.openocdscript=openocd_scripts/SAML21J18B.cfg
mattairtech_mt_d21j.menu.cpu.saml21j18b.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAML21J18B.bin
mattairtech_mt_d21j.menu.cpu.saml21j17b=SAML21J17B
mattairtech_mt_d21j.menu.cpu.saml21j17b.upload.maximum_size=122880
mattairtech_mt_d21j.menu.cpu.saml21j17b.build.extra_flags=-D__SAML21J17B__ {build.usb_flags}
mattairtech_mt_d21j.menu.cpu.saml21j17b.build.ldscript=flash_128KB.ld
mattairtech_mt_d21j.menu.cpu.saml21j17b.build.openocdscript=openocd_scripts/SAML21J17B.cfg
mattairtech_mt_d21j.menu.cpu.saml21j17b.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAML21J17B.bin
mattairtech_mt_d21j.menu.cpu.saml21j16b=SAML21J16B
mattairtech_mt_d21j.menu.cpu.saml21j16b.upload.maximum_size=57344
mattairtech_mt_d21j.menu.cpu.saml21j16b.build.extra_flags=-D__SAML21J16B__ {build.usb_flags}
mattairtech_mt_d21j.menu.cpu.saml21j16b.build.ldscript=flash_64KB.ld
mattairtech_mt_d21j.menu.cpu.saml21j16b.build.openocdscript=openocd_scripts/SAML21J16B.cfg
mattairtech_mt_d21j.menu.cpu.saml21j16b.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAML21J16B.bin
mattairtech_mt_d21j.menu.cpu.samc21j18a=SAMC21J18A
mattairtech_mt_d21j.menu.cpu.samc21j18a.upload.maximum_size=253952
mattairtech_mt_d21j.menu.cpu.samc21j18a.build.extra_flags=-D__SAMC21J18A__
mattairtech_mt_d21j.menu.cpu.samc21j18a.build.ldscript=flash_256KB.ld
mattairtech_mt_d21j.menu.cpu.samc21j18a.build.openocdscript=openocd_scripts/SAMC21J18A.cfg
mattairtech_mt_d21j.menu.cpu.samc21j18a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMC21J18A.bin
mattairtech_mt_d21j.menu.cpu.samc21j17a=SAMC21J17A
mattairtech_mt_d21j.menu.cpu.samc21j17a.upload.maximum_size=122880
mattairtech_mt_d21j.menu.cpu.samc21j17a.build.extra_flags=-D__SAMC21J17A__
mattairtech_mt_d21j.menu.cpu.samc21j17a.build.ldscript=flash_128KB.ld
mattairtech_mt_d21j.menu.cpu.samc21j17a.build.openocdscript=openocd_scripts/SAMC21J17A.cfg
mattairtech_mt_d21j.menu.cpu.samc21j17a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMC21J17A.bin
mattairtech_mt_d21j.menu.cpu.samc21j16a=SAMC21J16A
mattairtech_mt_d21j.menu.cpu.samc21j16a.upload.maximum_size=57344
mattairtech_mt_d21j.menu.cpu.samc21j16a.build.extra_flags=-D__SAMC21J16A__
mattairtech_mt_d21j.menu.cpu.samc21j16a.build.ldscript=flash_64KB.ld
mattairtech_mt_d21j.menu.cpu.samc21j16a.build.openocdscript=openocd_scripts/SAMC21J16A.cfg
mattairtech_mt_d21j.menu.cpu.samc21j16a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMC21J16A.bin
mattairtech_mt_d21j.menu.cpu.samc21j15a=SAMC21J15A
mattairtech_mt_d21j.menu.cpu.samc21j15a.upload.maximum_size=24576
mattairtech_mt_d21j.menu.cpu.samc21j15a.build.extra_flags=-D__SAMC21J15A__
mattairtech_mt_d21j.menu.cpu.samc21j15a.build.ldscript=flash_32KB.ld
mattairtech_mt_d21j.menu.cpu.samc21j15a.build.openocdscript=openocd_scripts/SAMC21J15A.cfg
mattairtech_mt_d21j.menu.cpu.samc21j15a.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMC21J15A.bin
mattairtech_mt_d21j.menu.bootloader.8kb=8KB
mattairtech_mt_d21j.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mattairtech_mt_d21j.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mattairtech_mt_d21j.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21j.menu.bootloader.8kb.upload.use_1200bps_touch=true
mattairtech_mt_d21j.menu.bootloader.8kb.upload.wait_for_upload_port=true
mattairtech_mt_d21j.menu.bootloader.8kb.upload.native_usb=true
mattairtech_mt_d21j.menu.bootloader.16kb=16KB
mattairtech_mt_d21j.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mattairtech_mt_d21j.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mattairtech_mt_d21j.menu.bootloader.16kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21j.menu.bootloader.16kb.upload.use_1200bps_touch=true
mattairtech_mt_d21j.menu.bootloader.16kb.upload.wait_for_upload_port=true
mattairtech_mt_d21j.menu.bootloader.16kb.upload.native_usb=true
mattairtech_mt_d21j.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_mt_d21j.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d21j.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d21j.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d21j.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d21j.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d21j.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d21j.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21j.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d21j.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21j.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21j.menu.serial.one_uart_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21j.menu.serial.one_uart_two_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21j.menu.serial.one_uart_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21j.menu.serial.one_uart_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21j.menu.serial.one_uart_two_wire=ONE_UART_TWO_WIRE_ONE_SPI
mattairtech_mt_d21j.menu.serial.one_uart_two_wire.build.serialcom_uart=ONE_UART
mattairtech_mt_d21j.menu.serial.one_uart_two_wire.build.serialcom_wire=TWO_WIRE
mattairtech_mt_d21j.menu.serial.one_uart_two_wire.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21j.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21j.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d21j.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21j.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21j.menu.serial.three_uart=THREE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21j.menu.serial.three_uart.build.serialcom_uart=THREE_UART
mattairtech_mt_d21j.menu.serial.three_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21j.menu.serial.three_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21j.menu.serial.three_uart_two_spi=THREE_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21j.menu.serial.three_uart_two_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21j.menu.serial.three_uart_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21j.menu.serial.three_uart_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21j.menu.serial.three_uart_two_wire=THREE_UART_TWO_WIRE_ONE_SPI
mattairtech_mt_d21j.menu.serial.three_uart_two_wire.build.serialcom_uart=THREE_UART
mattairtech_mt_d21j.menu.serial.three_uart_two_wire.build.serialcom_wire=TWO_WIRE
mattairtech_mt_d21j.menu.serial.three_uart_two_wire.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21j.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21j.menu.serial.no_uart.build.serialcom_uart=NO_UART
mattairtech_mt_d21j.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21j.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21j.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d21j.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d21j.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d21j.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d21j.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d21j.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d21j.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d21j.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d21j.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d21j.menu.usb.hid=HID_ONLY
mattairtech_mt_d21j.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d21j.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d21j.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d21j.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d21j.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d21j.menu.usb.none=USB_DISABLED
mattairtech_mt_d21j.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d21j.menu.usb.none.build.pid=0x0856


# MattairTech MT-D11 (D11D14AM, QFN-24)
mattairtech_mt_d11.name=MattairTech MT-D11
mattairtech_mt_d11.vid.0=0x16D0
mattairtech_mt_d11.pid.0=0x0557
mattairtech_mt_d11.vid.1=0x16D0
mattairtech_mt_d11.pid.1=0x0856
mattairtech_mt_d11.vid.2=0x16D0
mattairtech_mt_d11.pid.2=0x0B41
mattairtech_mt_d11.build.mcu=cortex-m0plus
mattairtech_mt_d11.build.f_cpu=48000000L
mattairtech_mt_d11.build.usb_product="MT-D11"
mattairtech_mt_d11.build.usb_manufacturer="MattairTech"
mattairtech_mt_d11.build.board=SAMD_ZERO
mattairtech_mt_d11.build.core=arduino
mattairtech_mt_d11.build.variant=MT_D11
mattairtech_mt_d11.build.variant_system_lib=
mattairtech_mt_d11.build.vid=0x16D0
mattairtech_mt_d11.upload.protocol=sam-ba
mattairtech_mt_d11.bootloader.tool=arduino:openocd
mattairtech_mt_d11.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32KHZ_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_mt_d11.menu.clock.internal=INTERNAL
mattairtech_mt_d11.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_mt_d11.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED
mattairtech_mt_d11.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_mt_d11.build.extra_flags=-D__SAMD11D14AM__ {build.usb_flags}
mattairtech_mt_d11.build.ldscript=linker_scripts/gcc/flash_16KB.ld
mattairtech_mt_d11.build.openocdscript=openocd_scripts/SAMD11D14AM.cfg
mattairtech_mt_d11.bootloader.file=zero/binaries/sam_m0p_sam_ba_SAMD11D14AM.bin
mattairtech_mt_d11.menu.bootloader.4kb=4KB
mattairtech_mt_d11.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
mattairtech_mt_d11.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
mattairtech_mt_d11.menu.bootloader.4kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d11.menu.bootloader.4kb.upload.use_1200bps_touch=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.wait_for_upload_port=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.native_usb=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.maximum_size=12288
mattairtech_mt_d11.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_mt_d11.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d11.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d11.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d11.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.maximum_size=16384
mattairtech_mt_d11.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d11.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_uart=NO_UART
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d11.menu.serial.two_uart=TWO_UART_ONE_WIRE_NO_SPI
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d11.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d11.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d11.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d11.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d11.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d11.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d11.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d11.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d11.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d11.menu.usb.hid=HID_ONLY
mattairtech_mt_d11.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d11.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d11.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d11.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d11.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d11.menu.usb.none=USB_DISABLED
mattairtech_mt_d11.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d11.menu.usb.none.build.pid=0x0856


